return function (self) 
_UtilDlgLogic:SendDialog(1012005, {
	"오오... 내가 만든 아이를 키우실 분이 당신이로군! 내 말이 들리오? 나는 지금 세계수의 가장 밑바닥 부근에서 생명수를 채취하고 있는 마법사라오. 지금 나는 당신의 마음에 직접 이야기를 걸고 있소.\n\n그 아이는, 내가 손수 만든 인형에 생명수를 뿌리고 마법을 걸어 만든 마법의 동물이오. 나는 오랜 세월동안 생명에 관한 연구를 해왔고, 생명을 탄생시키는 마법을 알아냈지만, 그건 생명수가 없이는 불가능한 것이었소. 하지만 이 생명수는 아주 조금씩 밖에 생겨나지 않기 때문에, 그 아이에게 많은 시간을 줄 수가 없구려...",
	"시간이 지나 그 아이에게 뿌려진 생명수가 모두 마르게 되면, 그 아이는 다시 인형으로 돌아가게 될것이오. 그건 매우 슬픈 일이겠지만 너무 걱정하지는 마시오. 다시 생명수를 뿌려주면 다시 살아날테니까.\n\n그걸 위해서 나는 이 지하 깊숙한 곳에서 열심히 하루도 쉬지않고 생명수를 모으고 있다오. 내 제자를 지상에 올려보냈으니, 생명수가 다시 필요해지는 날이 오거든, 내 제자를 찾아가시오. 잊지마시오. 그 아이에게 주어진 생명수는 90일이 지나면 사라질테니.. 부디 사랑해주시게..."
})
end